@rsawant23  I tried the way you asked me to check, but i still didn't see the issue. Is there anything i am missing ?

resource "bigip_ltm_virtual_address" "vs_va" {
  name            = "/Common/1.1.1.1"
  advertize_route = "selective"
  arp             = true
  auto_delete     = true
  conn_limit      = 0
  enabled         = true
  icmp_echo       = true
}

resource "bigip_ltm_virtual_server" "http" {
  name        = "/Common/terraform_vs_http"
  destination = bigip_ltm_virtual_address.vs_va.name
  port        = 80
  pool                 = bigip_ltm_pool.pool.name
  client_profiles      = [bigip_ltm_profile_client_ssl.clientssl_profile.name]

}

```
$ terraform apply

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # bigip_ltm_pool.pool will be created
  + resource "bigip_ltm_pool" "pool" {
      + allow_nat              = (known after apply)
      + allow_snat             = (known after apply)
      + id                     = (known after apply)
      + load_balancing_mode    = "round-robin"
      + minimum_active_members = 1
      + monitors               = (known after apply)
      + name                   = "/Common/Axiom_Environment_APP1_Pool"
      + reselect_tries         = (known after apply)
      + service_down_action    = (known after apply)
      + slow_ramp_time         = (known after apply)
    }

  # bigip_ltm_profile_client_ssl.clientssl_profile will be created
  + resource "bigip_ltm_profile_client_ssl" "clientssl_profile" {
      + alert_timeout                       = (known after apply)
      + allow_non_ssl                       = (known after apply)
      + authenticate                        = "always"
      + authenticate_depth                  = (known after apply)
      + ca_file                             = (known after apply)
      + cache_size                          = (known after apply)
      + cache_timeout                       = (known after apply)
      + cert                                = (known after apply)
      + cert_extension_includes             = (known after apply)
      + cert_life_span                      = (known after apply)
      + cert_lookup_by_ipaddr_port          = (known after apply)
      + chain                               = (known after apply)
      + ciphers                             = "DEFAULT"
      + client_cert_ca                      = (known after apply)
      + crl_file                            = (known after apply)
      + defaults_from                       = "/Common/clientssl"
      + forward_proxy_bypass_default_action = (known after apply)
      + full_path                           = (known after apply)
      + generation                          = (known after apply)
      + generic_alert                       = (known after apply)
      + handshake_timeout                   = (known after apply)
      + id                                  = (known after apply)
      + inherit_cert_keychain               = (known after apply)
      + key                                 = (known after apply)
      + mod_ssl_methods                     = (known after apply)
      + mode                                = (known after apply)
      + name                                = "/Common/test-ClientSsl"
      + partition                           = (known after apply)
      + passphrase                          = (known after apply)
      + peer_cert_mode                      = (known after apply)
      + proxy_ca_cert                       = (known after apply)
      + proxy_ca_key                        = (known after apply)
      + proxy_ca_passphrase                 = (known after apply)
      + proxy_ssl                           = (known after apply)
      + proxy_ssl_passthrough               = (known after apply)
      + renegotiate_period                  = (known after apply)
      + renegotiate_size                    = (known after apply)
      + renegotiation                       = (known after apply)
      + retain_certificate                  = (known after apply)
      + secure_renegotiation                = (known after apply)
      + server_name                         = (known after apply)
      + session_mirroring                   = (known after apply)
      + session_ticket                      = (known after apply)
      + sni_default                         = (known after apply)
      + sni_require                         = (known after apply)
      + ssl_forward_proxy                   = (known after apply)
      + ssl_forward_proxy_bypass            = (known after apply)
      + ssl_sign_hash                       = (known after apply)
      + strict_resume                       = (known after apply)
      + tm_options                          = (known after apply)
      + unclean_shutdown                    = (known after apply)

      + cert_key_chain {
          + cert       = (known after apply)
          + chain      = (known after apply)
          + key        = (known after apply)
          + name       = (known after apply)
          + passphrase = (known after apply)
        }
    }

  # bigip_ltm_virtual_address.vs_va will be created
  + resource "bigip_ltm_virtual_address" "vs_va" {
      + advertize_route = "selective"
      + arp             = true
      + auto_delete     = true
      + conn_limit      = 0
      + enabled         = true
      + icmp_echo       = true
      + id              = (known after apply)
      + name            = "/Common/1.1.1.1"
      + traffic_group   = "/Common/traffic-group-1"
    }

  # bigip_ltm_virtual_server.http will be created
  + resource "bigip_ltm_virtual_server" "http" {
      + client_profiles              = [
          + "/Common/test-ClientSsl",
        ]
      + destination                  = "/Common/1.1.1.1"
      + fallback_persistence_profile = (known after apply)
      + id                           = (known after apply)
      + ip_protocol                  = (known after apply)
      + mask                         = (known after apply)
      + name                         = "/Common/terraform_vs_http"
      + pool                         = "/Common/Axiom_Environment_APP1_Pool"
      + port                         = 80
      + profiles                     = (known after apply)
      + server_profiles              = (known after apply)
      + snatpool                     = (known after apply)
      + source                       = (known after apply)
      + source_address_translation   = (known after apply)
      + state                        = "enabled"
      + translate_address            = (known after apply)
      + translate_port               = (known after apply)
      + vlans_enabled                = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

bigip_ltm_virtual_address.vs_va: Creating...
bigip_ltm_pool.pool: Creating...
bigip_ltm_profile_client_ssl.clientssl_profile: Creating...
bigip_ltm_virtual_address.vs_va: Creation complete after 1s [id=/Common/1.1.1.1]
bigip_ltm_pool.pool: Creation complete after 1s [id=/Common/Axiom_Environment_APP1_Pool]
bigip_ltm_profile_client_ssl.clientssl_profile: Creation complete after 2s [id=/Common/test-ClientSsl]
bigip_ltm_virtual_server.http: Creating...
bigip_ltm_virtual_server.http: Creation complete after 4s [id=/Common/terraform_vs_http]

Apply complete! Resources: 4 added, 0 changed, 0 destroyed.
HYD-ML-00064439:terraform-provider-bigip papineni$ 

```